// MIDDLEWARES-פונקציה שקוראת בין הבקשה ןתגובה 
// מקבלת נתוני בקשה תגובה ןפוקצית נקסט
// גם הפונקציות בקונטרולר מכונות מידלוורס כי הן מתפקדות כמתווך בין הבקשה לתגובה

// ה MIDDELWARES מבצע:
// 1. הדפסות/ לוגיקה אחרת
// 2. להחזיר תגובה ללקוח כמו שראינו בקונטרולר 


export const printHello=(req,res,next)=>{
    console.log("hello", req.user1, req.method, req.url)

    // פונקציה שמאפשרת מעבר למידלאוור הבא רק אם לא שלחנו בתוכה פרמטרים
    next()
}

// מידלוואר ששולח תאריך התחלת בקשה למידלוואר הבא
// בצורה דומה נוכל לשלוח את ה USER הנוכחי

export const sendStartDate=(req,res,next)=>{    
   const now = new Date();
   console.log("start date", now)
//    כדי לשלוח מידע למידלוואר הבא
// נצרף אותם לאובייקט הבקשה התגובה
// ולאחר מיכן נקרא למידלוואר הבא ע"י נקסט ריק - ללא פרמטרים
   req.user1="admin"
   req.startDate=now;

//    אם  שולחים פרמטרים לנקסט - מוביל אותנו לערוץ של שגיאות וגם עוצר את התהליך הנוכחי
//    next(now)

   next()
}
